# Taps
# Example entry:
# tap 'homebrew/cask'

# Apps
cask 'whatsapp'
cask 'discord'
cask 'slack'
cask 'the-unarchiver'
cask 'steam'
cask 'transmission'

# Apps (Business)
cask '1password'
cask 'zoom'
cask 'google-chrome'
cask 'firefox'
cask 'figma'
cask 'gimp'
cask 'inkscape'

# Development (Base)
brew 'curl'
brew 'neovim'
brew 'fzf'
brew 'nvm'
brew 'zoxide'
brew 'zsh-autocomplete'
cask 'alacritty'
cask 'visual-studio-code'
cask 'insomnia'
cask 'docker'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'

# Development (Business)
brew 'redis'
brew 'pyenv'
brew 'poetry'
brew 'supabase/tap/supabase'
cask 'ngrok'
cask 'orbstack'

# Utils
brew 'blueutil'
brew 'mackup'
cask 'sanesidebuttons'
