# Taps
# Example entry:
# tap 'homebrew/cask'

# Apps
cask '1password'
cask 'blender'
cask 'discord'
cask 'slack'
cask 'the-unarchiver'
cask 'transmission'
cask 'whatsapp'
cask 'google-chrome'
cask 'steam'
cask 'notion'
cask 'nvidia-geforce-now'

# Apps (Business)
cask 'figma'
# cask 'firefox'
cask 'zoom'
# cask 'gimp'
# cask 'inkscape'

# Development (Base)
cask 'alacritty'
brew 'curl'
cask 'docker'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
brew 'fzf'
brew 'neovim'
brew 'nvm'
cask 'visual-studio-code'
brew 'zoxide'
brew 'zsh-autocomplete'
cask 'postman'
# cask 'insomnia'

# Development (Business)
# cask 'ngrok'
# cask 'orbstack'
# brew 'poetry'
# brew 'pyenv'
# brew 'redis'
# brew 'supabase/tap/supabase'
# cask 'loom'

# Utils
brew 'blueutil'
brew 'mackup'
cask 'sanesidebuttons'
brew 'openjdk@17'
